# -*- coding: utf-8 -*-

all_stocks = [
    {
        'code': 'hh00119', # 保利置业集团
        'trades': [
            ['2016-6-15', 1, 1000, 1.97, '2016-7-22', 2.13],
        ],
        'comment': '物业',
    },
    {
        'code': 'hh00308', # 香港中旅xgzl
        'trades': [
            ['2016-6-15', 2, 2000, 2.21, '2016-7-13', 2.40],
            ['2016-7-26', 1, 2000, 2.24],
        ],
        'comment': '旅行社',
    },
    {
        'code': 'hh00570', # 中国中药
        'trades': [
            ['2016-7-6', 1, 2000, 2.99],
        ],
        'comment': '医药',
    },
    {
        'code': 'hh01117', # 现代牧业xdmy
        'trades': [
            ['2016-6-15', 1, 1000, 1.37],
            ['2016-6-24', 1, 1000, 1.17],
            ['2016-7-15', 1, 1000, 1.03],
            ['2016-7-20', 1, 2000, 1.001],
        ],
        'comment': '蒙牛乳业',
    },
    {
        'code': 'hh03968', # 招商银行
        'margin': [5.5],
        'trades': [
        ],
        'comment': '银行',
    },
]

#all_stocks = all_stocks[0:1]
#all_stocks = all_stocks[22:23]

